socialNetwork/runs/e2e-read-user-timelines-1-9y7i/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/user-timeline/read
  4 threads and 64 connections

  Thread calibration: mean lat.: 22.244ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 23.086ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 21.941ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 23.305ms, rate sampling interval: 71ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    20.30ms    8.34ms  49.85ms   76.51%
    Req/Sec   251.94     61.79   402.00     69.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.40ms
 75.000%   23.84ms
 90.000%   31.06ms
 99.000%   49.85ms
 99.900%   66.62ms
 99.990%   78.85ms
 99.999%   84.48ms
100.000%   84.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.431     0.000000            1         1.00
      11.959     0.100000         2008         1.11
      13.679     0.200000         4016         1.25
      15.247     0.300000         6012         1.43
      16.847     0.400000         8028         1.67
      18.399     0.500000        10036         2.00
      19.263     0.550000        11024         2.22
      20.207     0.600000        12030         2.50
      21.231     0.650000        13024         2.86
      22.351     0.700000        14025         3.33
      23.839     0.750000        15043         4.00
      24.639     0.775000        15540         4.44
      25.535     0.800000        16032         5.00
      26.639     0.825000        16535         5.71
      27.791     0.850000        17029         6.67
      29.199     0.875000        17534         8.00
      30.063     0.887500        17785         8.89
      31.055     0.900000        18036        10.00
      32.047     0.912500        18284        11.43
      33.311     0.925000        18533        13.33
      34.719     0.937500        18786        16.00
      35.647     0.943750        18911        17.78
      36.607     0.950000        19037        20.00
      37.663     0.956250        19158        22.86
      38.911     0.962500        19283        26.67
      40.383     0.968750        19411        32.00
      41.183     0.971875        19472        35.56
      42.207     0.975000        19536        40.00
      43.231     0.978125        19596        45.71
      44.255     0.981250        19659        53.33
      45.919     0.984375        19721        64.00
      47.007     0.985938        19753        71.11
      47.935     0.987500        19785        80.00
      48.895     0.989062        19815        91.43
      50.335     0.990625        19847       106.67
      51.743     0.992188        19879       128.00
      52.447     0.992969        19894       142.22
      53.567     0.993750        19909       160.00
      54.495     0.994531        19925       182.86
      55.231     0.995313        19941       213.33
      56.543     0.996094        19956       256.00
      57.183     0.996484        19964       284.44
      58.175     0.996875        19972       320.00
      58.783     0.997266        19980       365.71
      59.583     0.997656        19988       426.67
      60.895     0.998047        19995       512.00
      61.535     0.998242        19999       568.89
      62.207     0.998437        20003       640.00
      63.167     0.998633        20007       731.43
      65.727     0.998828        20011       853.33
      67.135     0.999023        20015      1024.00
      67.711     0.999121        20017      1137.78
      67.903     0.999219        20019      1280.00
      68.863     0.999316        20021      1462.86
      69.503     0.999414        20023      1706.67
      72.895     0.999512        20025      2048.00
      75.711     0.999561        20026      2275.56
      75.839     0.999609        20027      2560.00
      76.287     0.999658        20028      2925.71
      76.607     0.999707        20029      3413.33
      77.823     0.999756        20031      4096.00
      77.823     0.999780        20031      4551.11
      77.823     0.999805        20031      5120.00
      77.823     0.999829        20031      5851.43
      78.847     0.999854        20032      6826.67
      78.847     0.999878        20032      8192.00
      78.847     0.999890        20032      9102.22
      80.383     0.999902        20033     10240.00
      80.383     0.999915        20033     11702.86
      80.383     0.999927        20033     13653.33
      80.383     0.999939        20033     16384.00
      80.383     0.999945        20033     18204.44
      84.479     0.999951        20034     20480.00
      84.479     1.000000        20034          inf
#[Mean    =       20.296, StdDeviation   =        8.344]
#[Max     =       84.416, Total count    =        20034]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29686 requests in 30.00s, 410.62MB read
Requests/sec:    989.58  
Transfer/sec:     13.69MB